#+TITLE: CIEHLO.org 
#+DATE: Fri Feb 14 10:05:32 2014
#+AUTHOR: Shunchao Wang
#+EMAIL: shunchao.wang@osumc.edu

* Tasks
** NEXT Technical Investigation                                    :ANALYSIS:
*** Flat File Model: CSV, Spreadsheet
- difficult to OOP
- No schema and dtd
- needs ETL
- Performance will be an issue
- Plain file can be versioned using svn, git, etc
*** Document Model: JSON, XML
- is closely aligned with OOP
- the schema is dynamic
- flex data type definition
- also needs ETL original data to the JSON format
- Performance issue: query and diff
- Plain file can be versioned using svn, git, etc
- need do a large data diff
- Engine: MongoDB
*** Graph Model
- Ealy align with OOP
- Well defined object association and dtd
- Also needs etl
- Performance issue
- Not clear if can be versioned using existing version control alg
:LOGBOOK:
CLOCK: [2014-02-14 Fri 13:01]--[2014-02-14 Fri 14:24] =>  1:23
CLOCK: [2014-02-14 Fri 12:27]--[2014-02-14 Fri 12:41] =>  0:14
CLOCK: [2014-02-14 Fri 10:35]--[2014-02-14 Fri 10:44] =>  0:09
CLOCK: [2014-02-14 Fri 10:08]--[2014-02-14 Fri 10:11] =>  0:03
CLOCK: [2014-02-14 Fri 10:05]--[2014-02-14 Fri 10:06] =>  0:01
:END:
[2014-02-14 Fri 10:05]
*** 
** HOLD Create sample OSGi projects                           :WAITING:HOLD:
- State "HOLD"       from "TODO"       [2014-02-14 Fri 10:35] \\
  Backlog.
  :LOGBOOK:
  CLOCK: [2014-02-14 Fri 10:33]--[2014-02-14 Fri 10:34] =>  0:01
  :END:
  [2014-02-14 Fri 10:33]
** NEXT Look into project structure of ACR-RISE and reuse to CIELHO. :ANALYSIS:
:LOGBOOK:
CLOCK: [2014-02-27 Thu 09:28]--[2014-02-27 Thu 09:29] =>  0:01
:END:
  [2014-02-27 Thu 09:28]
* Notes

